[
 {
   "id": 0,
   "title": "Herby spring chicken pot pie",
   "author": "Esther Clark",
   "preparation": "10 mins",
   "cooking": "30 mins",
   "serves": "4",
   "ingredients": "2 tbsp olive oil , plus a little extra for brushing over the pastry<br>bunch spring onions , sliced into 3cm pieces<br>250g frozen spinach<br>6 ready-cooked chicken thighs (or see tip, below)<br>350ml hot chicken stock<br>½ tbsp wholegrain mustard<br>200g frozen peas<br>200ml half-fat crème fraîche<br>½ small bunch tarragon , leaves finely chopped<br>small bunch parsley , finely chopped<br>270g pack filo pastry",
   "recipe": "Step 1<br>Heat oven to 200C/180C fan/gas 6. Heat the oil in a large, shallow casserole dish on a medium heat. Add the spring onions and fry for 3 mins, then stir through the frozen spinach and cook for 2 mins or until it’s starting to wilt. Remove the skin from the chicken and discard. Shred the chicken off the bone and into the pan, and discard the bones. Stir through the stock and mustard. Bring to a simmer and cook, uncovered, for 5-10 mins.<br><br>Step  2<br>Stir in the peas, crème fraîche and herbs, then remove from the heat. Scrunch the filo pastry sheets over the mixture, brush with a little oil and bake for 15-20 mins or until golden brown.",
   "kcal": 526,
   "fat": 22,
   "saturates": 8,
   "carbs": 47,
   "sugars": 7,
   "fibers": 7,
   "protein": 32,
   "salt": 1.3
 },
 {
   "id": 1,
   "title": "Healthy pasta primavera",
   "author": "Good Food team",
   "preparation": "10 min",
   "cooking": "20 mins",
   "serves": "4",
   "ingredients": "75g young broad beans (use frozen if you can't get fresh)<br>2 x 100g pack asparagus tips<br>170g peas (use frozen if you can't get fresh)<br>350g spaghetti or tagliatelle<br>175g pack baby leeks , trimmed and sliced<br>1 tbsp olive oil , plus extra to serve<br>1 tbsp butter<br>200ml tub fromage frais or creme fraiche<br>handful fresh chopped herbs (we used mint, parsley and chives)<br>parmesan (or vegetarian alternative), shaved, to serve",
   "recipe": "Step 1<br>Bring a pan of salted water to the boil and put a steamer (or colander) over the water. Steam the beans, asparagus and peas until just tender, then set aside. Boil the pasta following pack instructions.<br><br>Step  2<br>Meanwhile, fry the leeks gently in the oil and butter for 5 mins or until soft. Add the fromage frais to the leeks and very gently warm through, stirring constantly to ensure it doesn’t split. Add the herbs and steamed vegetables with a splash of pasta water to loosen.<br><br>Step  3<br>Drain the pasta and stir into the sauce. Adjust the seasoning, then serve scattered with the cheese and drizzled with a little extra olive oil.",
   "kcal": 476,
   "fat": 9,
   "saturates": 3,
   "carbs": 74,
   "sugars": 6,
   "fibers": 9,
   "protein": 20,
   "salt": 0.1
 },
 {
   "id": 2,
   "title": "One-pan salmon with roast asparagus",
   "author": "Barney Desmazery",
   "preparation": "20 mins",
   "cooking": "50 mins",
   "serves": "2",
   "ingredients": "400g new potato, halved if large<br>2 tbsp olive oil<br>8 asparagus spears, trimmed and halved<br>2 handfuls cherry tomatoes<br>1 tbsp balsamic vinegar<br>2 salmon fillets, about 140g/5oz each<br>handful basil leaves",
   "recipe": "Step 1<br>Heat oven to 220C/fan 200C/gas 7. Tip the potatoes and 1 tbsp of olive oil into an ovenproof dish, then roast the potatoes for 20 mins until starting to brown. Toss the asparagus in with the potatoes, then return to the oven for 15 mins.<br><br>Step  2<br>Throw in the cherry tomatoes and vinegar and nestle the salmon amongst the vegetables. Drizzle with the remaining oil and return to the oven for a final 10-15 mins until the salmon is cooked. Scatter over the basil leaves and serve everything scooped straight from the dish.",
   "kcal": 483,
   "fat": 25,
   "saturates": 4,
   "carbs": 34,
   "sugars": 6,
   "fibers": 3,
   "protein": 33,
   "salt": 0.24
 },
 {
   "id": 3,
   "title": "Nettle spanakopita",
   "author": "Barney Desmazery",
   "preparation": "20 mins",
   "cooking": "50 mins",
   "serves": "6",
   "ingredients": "150g nettle leaves<br>100g butter , 25g solid, 75g melted<br>200g feta , crumbled<br>50g parmesan , finely grated<br>1 lemon , zested and juiced<br>1 egg , beaten<br>grated nutmeg<br>7 sheets filo pastry<br>1 tbsp sesame seeds<br>green salad , to serve",
   "recipe": "Step 1<br>For the filling, wash the nettles well but don’t drain them too thoroughly. Heat the solid butter in a large frying pan. When it’s sizzling and has turned a nutty brown, add the nettles and cook for about 6 mins until wilted. Leave to cool.<br><br>Step  2<br>Using a tea towel, squeeze as much liquid out of the nettles as you can, then roughly chop and tip into a bowl. Mix in the feta, parmesan, lemon zest and juice, about two-thirds of the egg and some nutmeg, and season generously. The filling should be loose but not sloppy.<br><br>Step  3<br>Heat oven to 200C/180C fan/gas 6. To assemble the spanakopita, lay three sheets of filo end-to-end on your work surface, overlapping by about 5cm. Brush each piece with melted butter and top with three more sheets, then brush with more butter and add the final sheet to the middle for extra support. Spoon the nettle mix along the edge, about 2cm wide, and tuck over the short ends to stop any filling from coming out. Roll the pastry into a long sausage shape. Starting with one end, roll up the sausage into a spiral shape about 20cm wide. Put the spanakopita in a shallow round pan, like an ovenproof frying pan, if it fits. If not, slide it onto a buttered baking tray.<br><br>Step  4<br>Brush the pie liberally with the remaining egg and scatter with the sesame seeds. Bake for 40-45 mins or until golden brown. Leave to cool until just warm, then serve in slices with a peppery salad.",
   "kcal": 421,
   "fat": 26,
   "saturates": 15,
   "carbs": 30,
   "sugars": 2,
   "fibers": 4,
   "protein": 15,
   "salt": 1.8
 },
 {
   "id": 4,
   "title": "Spring chicken in a pot",
   "author": "Mary Cadogan",
   "preparation": "20 mins",
   "cooking": "45 mins",
   "serves": "4",
   "ingredients": "1 tbsp olive oil<br>1 onion , chopped<br>500g boneless, skinless chicken thigh<br>300g small new potato<br>425ml low-salt vegetable stock (such as Kallo low-salt vegetable stock cubes)<br>350g broccoli , cut into small florets<br>350g spring green , shredded<br>140g petits pois<br>bunch spring onion , sliced<br>2 tbsp pesto",
   "recipe": "Step 1<br>Heat the oil in a large, heavy pan. Add the onion, gently fry for 5 mins until softened, add the chicken, then fry until lightly coloured. Add the potatoes, stock and plenty of freshly ground black pepper, then bring to the boil. Cover, then simmer for 30 mins until the potatoes are tender and the chicken is cooked. Can be frozen at this point.<br><br>Step  2<br>Add the broccoli, spring greens, petit pois and spring onions, stir well, then return to the boil. Cover, then cook for 5 mins more, stir in the pesto and heat through.",
   "kcal": 339,
   "fat": 10,
   "saturates": 3,
   "carbs": 27,
   "sugars": 12,
   "fibers": 8,
   "protein": 36,
   "salt": 0.5
 },
 {
   "id": 5,
   "title": "Pea, mint & spring onion soup with parmesan biscuits",
   "author": "Good Food team",
   "preparation": "20 mins",
   "cooking": "25 mins",
   "serves": "6",
   "ingredients": "1 tbsp olive oil<br>knob of butter<br>½ bunch spring onion , sliced, plus a few extra to serve<br>1 potato , cut into small dice<br>1l hot vegetable stock<br>900g frozen petits pois<br>½ small bunch mint , leaves picked, plus a few extra to serve<br>85g parmesan (or vegetarian alternative), very finely grated",
   "recipe": "Step 1<br>Heat the olive oil and butter in a heavy based pan. When foaming, add the spring onions and potato. Gently fry without colouring for about 5 mins. Stir in the stock, bring to the boil and simmer for 10 mins or until the potato is tender.<br><br>Step  2<br>Stir in the peas, bring to the boil again, then cook for about 3 mins until they are just done. Remove the pan from the heat, add the mint leaves and whizz in a blender or food processor until smooth.<br><br>Step  3<br>To make the parmesan biscuits, heat the grill to high. Line a baking sheet with baking parchment and divide the grated parmesan into 6 long strips. Grill for 1 min or until the cheese has melted and is lightly golden. While still warm and a bit flexible, release the biscuits from the baking parchment with a palette or cutlery knife, then cool until firm.<br><br>Step  4<br>To serve, heat the soup and divide between 6 bowls. Scatter with mint and sliced spring onions, if you like, and serve with the parmesan biscuits on the side.",
   "kcal": 213,
   "fat": 9,
   "saturates": 4,
   "carbs": 20,
   "sugars": 8,
   "fibers": 8,
   "protein": 15,
   "salt": 0.72
 },
 {
   "id": 6,
   "title": "Pea & broad bean shakshuka",
   "author": " Lulu Grimes",
   "preparation": "20 mins",
   "cooking": "30 mins",
   "serves": "4",
   "ingredients": "1 bunch asparagus spears<br>200g sprouting broccoli<br>2 tbsp olive oil<br>2 spring onions , finely sliced<br>2 tsp cumin seeds<br>large pinch cayenne pepper , plus extra to serve<br>4 ripe tomatoes , chopped<br>1 small pack parsley , finely chopped<br>50g shelled peas<br>50g podded broad beans<br>4 large eggs<br>50g pea shoots<br>Greek yogurt and flatbreads, to serve",
   "recipe": "Step 1<br>Trim or snap the woody ends of the asparagus and finely slice the spears, leaving the tips and about 2cm at the top intact. Finely slice the broccoli in the same way, leaving the heads and about 2cm of stalk intact. Heat the oil in a frying pan. Add the spring onions, sliced asparagus and sliced broccoli, and fry gently until the veg softens a little, then add the cumin seeds, cayenne, tomatoes (with their juices), parsley and plenty of seasoning, and stir. Cover with a lid and cook for 5 mins to make a base sauce, then add the asparagus spears, broccoli heads, peas and broad beans, cover again and cook for 2 mins.<br><br>Step  2<br>Make 4 dips in the mixture. Break an egg into each dip, arrange half the pea shoots around the eggs, season well, cover with a lid and cook until the egg whites are just set. Serve with the rest of the pea shoots, a spoonful of yogurt and some flatbreads, and sprinkle over another pinch of cayenne, if you like.",
   "kcal": 199,
   "fat": 12,
   "saturates": 2,
   "carbs": 7,
   "sugars": 5,
   "fibers": 7,
   "protein": 13,
   "salt": 0.2
 },
 {
   "id": 7,
   "title": "Spring greens carbonara",
   "author": "Cassie Best",
   "preparation": "20 mins",
   "cooking": "20 mins",
   "serves": "4",
   "ingredients": "2½ tbsp olive oil<br>200g pancetta cubes or slices, or use guanciale or bacon lardons<br>small bunch of parsley, roughly chopped<br>2 small bunches of basil, leaves picked<br>4 large mint sprigs, leaves picked and roughly chopped<br>4 egg yolks<br>50g parmesan, grated, plus extra to serve<br>350g spaghetti<br>125g asparagus, woody ends removed, cut into 3-4cm pieces<br>125g long-stemmed broccoli, trimmed and cut into 5cm pieces<br>125g fresh or frozen peas (shelled if fresh)<br>extra virgin olive oil, for drizzling (optional)",
   "recipe": "Step 1<br>Boil the kettle. Heat ½ tbsp oil in a large, deep frying pan or saucepan over a low-medium heat and sizzle the pancetta until crisp, about 5 mins. Once crisp, reduce the heat to as low as it will go to keep warm.<br><br>Step  2<br>Meanwhile, put the parsley, basil, mint and remaining oil in a small food processor and blitz until finely chopped. Or, finely chop the herbs using a sharp knife and omit the oil. Whisk the egg yolks and parmesan together in a separate bowl.<br><br>Step  3<br>Fill a large saucepan with boiling water from the kettle, season well with salt and bring to the boil on the hob, then cook the spaghetti for 10 mins until al dente. Add the asparagus and broccoli for the final 3 mins of cooking cooking, and the peas for the final 30 seconds.<br><br>Step  4<br>Lift the spaghetti into the pan with the pancetta using tongs, allowing a little water to be added with each addition of pasta. Drain the boiled veg but reserve a mug of the cooking water, then add the veg to the pan with the spaghetti and pancetta. Keep the heat set as low as possible and ensure there is a small puddle of the pasta cooking water in the bottom of the pan. This will prevent anything catching and help loosen the sauce.<br><br>Step  5<br>Scrape all of the herb mixture and the egg and cheese over the warm spaghetti mixture and use tongs to toss everything together, ensuring each strand of spaghetti is well-coated. Continue tossing the pasta through the sauce for a few minutes, turning the heat up slightly if needed until the sauce thickens and clings to the spaghetti. Add splashes of the reserved pasta cooking water if the sauce becomes too thick – the spaghetti should be glossy and shiny when ready.<br><br>Step  6<br>Divide between bowls and top with extra parmesan, a grinding of black pepper and a drizzle of extra virgin olive oil, if you like.",
   "kcal": 700,
   "fat": 30,
   "saturates": 9,
   "carbs": 71,
   "sugars": 5,
   "fibers": 7,
   "protein": 32,
   "salt": 2
 },
 {
   "id": 8,
   "title": "Parmesan spring chicken",
   "author": "Good Food team",
   "preparation": "10 mins",
   "cooking": "10 mins",
   "serves": "4",
   "ingredients": "1 egg white<br>5 tbsp finely grated parmesan<br>4 boneless, skinless chicken breasts<br>400g new potatoes , cut into small cubes<br>140g frozen peas<br>good handful baby spinach leaves<br>1 tbsp white wine vinegar<br>2 tsp olive oil",
   "recipe": "Step 1<br>Heat grill to medium and line the grill pan with foil. Beat the egg white on a plate with a little salt and pepper. Tip the parmesan onto another plate. Dip the chicken first in egg white, then in the cheese. Grill the coated chicken for 10-12 mins, turning once until browned and crisp.<br><br>Step  2<br>Meanwhile, boil the potatoes for 10 mins, adding the peas for the final 3 mins, then drain. Toss the vegetables with the spinach leaves, vinegar, oil and seasoning to taste. Divide between four warm plates, then serve with the chicken.",
   "kcal": 339,
   "fat": 11,
   "saturates": 3,
   "carbs": 20,
   "sugars": 3,
   "fibers": 3,
   "protein": 42,
   "salt": 0.53
 },
 {
   "id": 9,
   "title": "Roasted radishes",
   "author": "Samuel Goldsmith",
   "preparation": "5 mins",
   "cooking": "35 mins",
   "serves": "6",
   "ingredients": "400g radishes<br>6 garlic cloves, unpeeled and bashed<br>1 tbsp rapeseed oil",
   "recipe": "Step 1<br>Heat the oven to 200C/180C fan/ gas 6. Tip the radishes and bashed garlic cloves into a roasting tin, season well and drizzle with the oil. Toss to coat the radishes and garlic.<br><br>Step  2<br>Roast for 30-40 mins, or until the radishes are tender. Squeeze the garlic from its skins, then stir gently and serve.",
   "kcal": 30,
   "fat": 2,
   "saturates": 0.2,
   "carbs": 2,
   "sugars": 1,
   "fibers": 1,
   "protein": 1,
   "salt": 0.02
 },
 {
   "id": 10,
   "title": "Spring salmon with minty veg",
   "author": "Good Food team",
   "preparation": "10 mins",
   "cooking": "10 mins",
   "serves": "4",
   "ingredients": "750g small new potato , thickly sliced<br>750g frozen pea and beans (we used Waitrose pea and bean mix, £2.29/1kg)<br>3 tbsp olive oil<br>zest and juice of 1 lemon<br>small pack mint , leaves only<br>4 salmon fillets about 140g/5oz each",
   "recipe": "Step 1<br>Boil the potatoes in a large pan for 4 mins. Tip in the peas and beans, bring back up to a boil, then carry on cooking for another 3 mins until the potatoes and beans are tender. Whizz the olive oil, lemon zest and juice and mint in a blender to make a dressing(or finely chop the mint and whisk into the oil and lemon).<br><br>Step  2<br>Put the salmon in a microwave-proof dish, season, then pour the dressing over. Cover with cling film, pierce, then microwave on High for 4-5 mins until cooked through. Drain the veg, then mix with the hot dressing and cooking juices from the fish. Serve the fish on top of the vegetables.",
   "kcal": 555,
   "fat": 26,
   "saturates": 5,
   "carbs": 42,
   "sugars": 8,
   "fibers": 10,
   "protein": 40,
   "salt": 0.23
 },
 {
   "id": 11,
   "title": "Rhubarb & gingernut cheesecake",
   "author": "Rosie Birkett",
   "preparation": "20 mins",
   "cooking": "25 mins",
   "serves": "8 to 10",
   "ingredients": "500g forced rhubarb , chopped into 4cm lengths<br>150g caster sugar<br>1 blood orange , zested and juiced<br>1 vanilla pod<br>100g butter , melted, plus extra for the tin<br>200g gingernut biscuits<br>500g mascarpone or soft cheese<br>100g quark or thick natural yogurt<br>1 tbsp pistachios , chopped",
   "recipe": "Step 1<br>Heat oven to 200C/180C fan/gas 6. Line a large baking tray with baking parchment and fill with the rhubarb. Scatter over the sugar and orange zest and pour over the juice. Scrape the seeds from the vanilla pod in there too, throwing the spent pod on top. Cover with foil and roast for 20 mins. Remove from the oven. Purée a third of the rhubarb, reserving the rest for the top.<br><br>Step  2<br>Butter a 20cm springform cake tin and line it with baking parchment. To make the base, put the biscuits in a bag and smash them with a rolling pin, or put them in a food processor and grind to crumbs. Tip into a mixing bowl, and stir in a pinch of sea salt. Pour the butter over the crumbs. Mix it together with a fork and tip it into the tin. Tap the side of the tin with your hand to even the crumbs out, and gently compress it with the back of a large spoon until it’s packed in and level. You want it fairly well packed so that it holds together. Put in the fridge to chill.<br><br>Step  3<br>To make the filling, put the cheese and quark or yogurt into a mixing bowl, or the bowl of a stand mixer, and beat it together. Mix until combined and thickened, then fold through the rhubarb purée.<br><br>Step  4<br>Pile the mixture on top of the biscuit base and smooth it down. Cover with cling film and chill overnight until set. Remove the rhubarb from its syrup with a slotted spoon, tip the syrup into a pan and bring to the boil. Reduce for about 3-5 mins until the syrup is more concentrated. Allow to cool.<br><br>Step  5<br>Carefully remove the cheesecake from its tin. Pile the rhubarb on top and drizzle over some syrup (you can save the rest for drizzling over porridge), then scatter with the pistachios to serve.",
   "kcal": 466,
   "fat": 34,
   "saturates": 21,
   "carbs": 33,
   "sugars": 24,
   "fibers": 2,
   "protein": 6,
   "salt": 0.5
 },
 {
   "id": 12,
   "title": "Greek roast lamb",
   "author": "Barney Desmazery",
   "preparation": "15 mins",
   "cooking": "1 hr and 45 mins",
   "serves": "8",
   "ingredients": "1 large leg of lamb, about 3kg/6lb 8oz<br>6 garlic cloves<br>1 bunch oregano<br>zest and juice 1 lemon<br>6 tbsp olive oil<br>1 ½kg new potatoes<br>400g can chopped tomato<br>large handful pitted baby kalamata olives",
   "recipe": "Step 1<br>Heat oven to 240C/fan 220C/gas 9. Pound the garlic, half the oregano, lemon zest and a pinch of salt in a pestle and mortar, then add the lemon juice and a drizzle of olive oil. Stab the lamb all over with a sharp knife, then push as much of the herb paste as you can into the holes.<br><br>Step  2<br>Tip the potatoes into a large roasting tin, then toss in the remaining olive oil and any remaining herb paste. Nestle the lamb amongst the potatoes, roast for 20 mins, then reduce the temperature to 180C/fan 160C/gas 4. Roast for 1 hr 15 mins for medium-rare, adding another 15 mins if you prefer your lamb medium. Baste the lamb once or twice with the juices and toss the potatoes. When the lamb is done to your liking, remove from the tin and let it rest. Throw the rest of the oregano in with the potatoes, scoop from the tin and keep warm.<br><br>Step  3<br>Place the roasting tin over a medium flame, add the canned tomatoes and olives to the pan juices, then simmer for a few mins. Serve the lamb with the potatoes and sauce and a simple salad.",
   "kcal": 685,
   "fat": 36,
   "saturates": 14,
   "carbs": 32,
   "sugars": 4,
   "fibers": 3,
   "protein": 59,
   "salt": 0.54
 },
 {
   "id": 13,
   "title": "Green spinach & lemon risotto with crispy prosciutto",
   "author": "Rosie Birkett",
   "preparation": "10 mins",
   "cooking": "40 mins",
   "serves": "2",
   "ingredients": "750ml warm vegetable stock or chicken stock<br>100g spinach<br>small bunch parsley<br>3 tbsp olive oil<br>4 slices prosciutto<br>10g butter<br>1 thyme sprig , leaves picked<br>1 leek , the white part finely chopped (freeze the green part to use in stock)<br>1 large garlic clove , finely chopped<br>150g arborio risotto rice<br>75ml dry white wine or vermouth<br>20g parmesan , grated plus extra to serve<br>½ lemon , zested and juiced<br>2 tbsp double cream (optional)<br>whole nutmeg , for grating",
   "recipe": "Step 1<br>Pour the stock into a saucepan and bring to the boil. Blanch the spinach and parsley in the stock for 30 seconds until wilted and bright green, then remove with a slotted spoon and leave to cool for a moment. Turn the stock down to a low heat. Squeeze out any excess water from the spinach and parsley, then tip into a food processor or mini chopper. Add 2 tbsp of the olive oil and 1 tbsp water, then blitz to a fine purée and set aside.<br><br>Step  2<br>Heat the remaining oil in a large non-stick frying pan or skillet and fry the prosciutto until crisp. Transfer the prosciutto to a plate covered with kitchen paper and set aside. Put half the butter, the thyme leaves, leek and garlic in the frying pan and season. Scrape up any crisp bits left over from the prosciutto and fry gently for a few mins over a medium heat until the leek is softened and aromatic but not browning. Add the rice, stirring to coat in the garlic mix, and cook for 2 mins until turning translucent, then pour in the wine and cook for another 2 mins until evaporated. Add one ladleful of the warm stock and cook until absorbed, stirring continuously.<br><br>Step  3<br>Continue this process one ladleful at a cooking for 20-30 mins, stirring constantly, until the rice is creamy but still retaining a little bite and without a chalky core. Remove the pan from the heat and stir through the remaining butter, the parmesan, most of the lemon zest, the lemon juice and cream (if using). Stir through the spinach purée, then season well with a little freshly grated nutmeg. Divide between two plates, top with the crisp prosciutto and sprinkle over a little more parmesan and lemon zest.",
   "kcal": 701,
   "fat": 30,
   "saturates": 9,
   "carbs": 65,
   "sugars": 3,
   "fibers": 7,
   "protein": 32,
   "salt": 3
 },
 {
   "id": 14,
   "title": "Spring tarts with watercress salsa verde & whipped lemon feta",
   "author": "Cassie Best",
   "preparation": "20 mins",
   "cooking": "30 mins",
   "serves": "4",
   "ingredients": "320g sheet ready rolled all-butter puff pastry<br>1 egg yolk , to glaze<br>handful baby carrots (about 8), peeled and any fat ones halved<br>handful radishes (about 10), halved<br>olive oil or rapeseed oil, for drizzling<br>bunch of thin-stemmed asparagus (about 16), woody ends trimmed<br>handful sugar snap peas (about 16)<br>100g fresh or frozen garden peas",
   "recipe": "Step 1<br>Heat oven to 200C/180C fan/gas 6. Unroll the pastry but leave it on the parchment, then transfer it to a baking tray. Brush egg yolk all over. Trim the edges with a large, sharp knife – this will give you a neater finish but isn’t essential. Cut the pastry in half lengthways, and move the pieces apart so they have a little space to puff up as they cook. Score a border about 1cm from the edge of the pastry, all the way around, then cut slashes across the centre to prevent it from puffing too much. Be careful not to score the border.<br><br>Step  2<br>Toss the carrots and radishes in a little oil and a sprinkling of salt in a small roasting tin. Put the pastry on the top shelf of the oven and the veg on the middle one, and cook for 25 mins, or until the pastry is golden and has a crisp base, and the veg are starting to soften. Leave to cool while you make the lemony feta.<br><br>Step  3<br>Crumble the feta into a bowl, add the mascarpone, lemon zest and milk and blend using an electric hand whisk until smooth. Chill until needed. To make the salsa verde, put all the ingredients in a small hand processor and whizz to a pesto consistency. This will keep in the fridge for a few days.<br><br>Step  4<br>Bring a pan of water to the boil, and have a bowl to hand filled with cold water and some ice. Add the asparagus to the boiling water and cook for 1-2 mins until bright green but still crunchy. Use a slotted spoon to scoop out and plunge straight into the iced water. Do the same with the sugar snaps, and finally the peas, draining these in a sieve, then cool in the ice water with the other veg.<br><br>Step  5<br>Spread the whipped feta over the bases, top with the veg (you can mix them up or keep the roasted veg on one tart and the green veg on the other, if you like), then drizzle with salsa verde and a little oil. Best served within an hour or two, but leftovers will keep for a day in the fridge.",
   "kcal": 438,
   "fat": 36,
   "saturates": 17,
   "carbs": 17,
   "sugars": 4,
   "fibers": 3,
   "protein": 9,
   "salt": 1
 },
 {
   "id": 15,
   "title": "Spring fish pie",
   "author": "Good Food team",
   "preparation": "5 mins",
   "cooking": "35 mins",
   "serves": "2",
   "ingredients": "250g bag washed leaf spinach<br>450g small new potato<br>2 eggs<br>300g skinless, boneless white fish fillet, cut into large chunks<br>100g half-fat crème fraîche<br>juice ½ lemon<br>1 tbsp olive oil",
   "recipe": "Step 1<br>Heat oven to 220C/fan 200C /gas 7. Tip the spinach into a colander sitting in the sink and tip the potatoes into a saucepan. Bring a kettle full of water to the boil and pour enough over the potatoes to cover and slowly pour the rest over the spinach to wilt it. Bring the potatoes to the boil and cook for 8-10 mins until tender, then drain and roughly mash.<br><br>Step  2<br>Leave the spinach to cool, then squeeze out excess water with your hands. Scatter the spinach over the bottom of 2 individual or 1 small ovenproof dish leaving two gaps for the eggs. Crack the eggs into the gaps, then season with salt and pepper. Distribute the fish over the spinach and eggs. Spread over the crème fraîche and drizzle with the lemon juice. Loosely spoon over the potatoes, drizzle over the olive oil, then bake for 20-25 mins until the top is crispy and golden and the sauce is bubbling at the sides. Leave to stand for a few mins, then serve straight from the dish.",
   "kcal": 529,
   "fat": 22,
   "saturates": 7.7,
   "carbs": 41,
   "sugars": 6.5,
   "fibers": 4.9,
   "protein": 44,
   "salt": 1
 },
 {
   "id": 16,
   "title": "Purple sprouting broccoli orecchiette with an almond crumb",
   "author": "Rosie Birkett",
   "preparation": "15 mins",
   "cooking": "30 mins",
   "serves": "2",
   "ingredients": "2 tbsp extra virgin olive oil<br>6 good-quality anchovies in oil<br>1 shallot , finely chopped<br>½-1 red chilli , deseeded and finely chopped<br>2 garlic cloves , crushed<br>100ml white wine or vermouth<br>200g purple sprouting broccoli , florets and leaves carefully removed, stalks roughly chopped<br>100g dried orecchiette , or pasta of your choice<br>½ lemon , juiced (save the zest for the almond crumb)<br>1 tbsp flat-leaf parsley , roughly chopped<br>grated parmesan , to serve",
   "recipe": "Step 1<br>To make the almond crumb, blitz the bread in a food processor to coarse crumbs. Toast the almonds in a dry, non-stick frying pan until golden, then tip into a bowl. Heat the oil in the same pan over a medium heat, then add the parsley, rosemary, lemon zest and garlic, stirring constantly, for about 30 seconds. Add the breadcrumbs and fry until crunchy and golden, stirring constantly, for 3-5 mins. Tip into the bowl with the almonds, add a pinch of salt and stir to combine.<br><br>Step  2<br>Put the frying pan back on the heat and add the extra virgin olive oil and anchovies, stirring until the anchovies have melted into the oil, a couple of mins. Tip in the shallot, chilli and garlic and cook, stirring, for another 4 mins until the shallot has softened and is fragrant. Pour over the wine, and cook for another few mins until mostly evaporated, then remove the pan from the heat.<br><br>Step  3<br>Bring a large pan of salted water to the boil. Once at a rolling boil, add the broccoli stalks and boil for 2 mins, then add the leaves and florets and boil for a further 1-2 mins until tender. Use a slotted spoon to transfer from the water to a bowl of iced water. Keep the broccoli water on the boil.<br><br>Step  4<br>Tip the pasta into the broccoli water and cook following pack instructions until al dente. A couple of mins before it’s cooked, put the pan with the anchovies back over a low-medium heat, remove the broccoli from the iced water and add to the frying pan, stirring to coat. Drain the pasta, reserving a cup of the cooking water, then turn the heat up under the frying pan and add the pasta and a good slosh of its water, tossing to combine. Squeeze over the lemon juice and stir in the parsley, then divide between plates and top with the almond crumb and grated parmesan.",
   "kcal": 592,
   "fat": 29,
   "saturates": 4,
   "carbs": 55,
   "sugars": 5,
   "fibers": 7,
   "protein": 16,
   "salt": 1.6
 },
 {
   "id": 17,
   "title": "Hot-smoked salmon salad with a chilli lemon dressing",
   "author": "Good Food team",
   "preparation": "20 mins",
   "cooking": "10 mins",
   "serves": "8",
   "ingredients": "500g new potato , halved<br>200g pack asparagus tips<br>250g bag mixed salad leaves (including young beetroot leaves and watercress)<br>bunch each parsley and mint, leaves picked and roughly chopped<br>140g radish , thinly sliced<br>8 x hot-smoked salmon steaks, skin removed<br>4 spring onions , sliced diagonally",
   "recipe": "Step 1<br>Boil potatoes in salted water for 10 mins until tender, adding the asparagus tips for the final 2 mins of cooking. Drain and allow to cool. Whisk together the salad dressing ingredients. then season to taste.<br><br>Step  2<br>In a large bowl, toss together the potatoes, asparagus, salad leaves, herbs and radishes. Add two-thirds of the dressing, thoroughly mix through the salad, then spread the salad over a large platter. Break the hot-smoked salmon into large chunks, then scatter over the top along with the spring onions. Finish by pouring remaining dressing over the top.",
   "kcal": 299,
   "fat": 19,
   "saturates": 3,
   "carbs": 13,
   "sugars": 3,
   "fibers": 2,
   "protein": 21,
   "salt": 2.09
 },
 {
   "id": 18,
   "title": "Hot cross bread & lemon pudding",
   "author": "Sarah Cook",
   "preparation": "20 mins",
   "cooking": "40 mins",
   "serves": "4",
   "ingredients": "knob of butter , for the dish<br>4 stale hot cross buns<br>200g lemon curd<br>2 large eggs<br>200ml double cream<br>200ml milk<br>½ tsp vanilla extract<br>4 tbsp caster sugar<br>little lemon zest<br>cream or vanilla ice cream , to serve (optional)",
   "recipe": "Step 1<br>Butter a 1-litre baking dish that will quite snugly fit the buns. Cut each bun into 3 slices, and sandwich back together with a generous spreading of curd. Arrange buns in the dish.<br><br>Step  2<br>Whisk egg, cream, milk and remaining curd, then sieve into a jug with the vanilla and 3 tbsp of the sugar. Pour over the buns and stand at room temperature for 30 mins for the custard to soak in.<br><br>Step  3<br>Heat oven to 160C/140C fan/ gas 3. Scatter the remaining sugar and lemon zest over the pudding. Bake for 30-40 mins until the top is golden and the custard gently set. Stand for 5 mins, then serve with cream or vanilla ice cream, if you like.",
   "kcal": 676,
   "fat": 38,
   "saturates": 20,
   "carbs": 74,
   "sugars": 49,
   "fibers": 1,
   "protein": 10,
   "salt": 0.4
 },
 {
   "id": 19,
   "title": "Spring green fattoush",
   "author": "Good Food team",
   "preparation": "20 mins",
   "cooking": "10 mins",
   "serves": "6 to 8",
   "ingredients": "500g broad beans , frozen or fresh<br>1 cucumber<br>3 wholemeal pitta breads<br>zest and juice 1 lemon<br>4 tbsp olive oil<br>1 tsp caster sugar<br>20g bunch mint , smaller leaves picked, rest very roughly chopped<br>20g bunch flat-leaf parsley , very roughly chopped<br>small bunch chives , snipped<br>170g feta cheese , crumbled",
   "recipe": "Step 1<br>First get all the ingredients ready. Bring a pan of water to the boil, add the beans and boil for 2-3 mins until just tender. Drain, rinse with cold water to cool, then drain again. Pod the beans from their skins into a large mixing bowl, discard the skins. Halve cucumber lengthways, scrap out the seeds using a teaspoon, then slice into half-moons and throw in with the beans. Split the pittas so you have 6 thin circles of bread, then toast.<br><br>Step  2<br>Whisk together lemon zest, juice, olive oil and sugar with plenty of seasoning. Pour over the beans and cucumber, add all the herbs and toss together. Tear the toasted pitta into pieces and add this to the salad with the crumbled feta. Toss together very gently – hands are best – then pile onto a platter to serve.",
   "kcal": 264,
   "fat": 15,
   "saturates": 5,
   "carbs": 22,
   "sugars": 4,
   "fibers": 7,
   "protein": 13,
   "salt": 1.12
 }
]